Repository: NaN-tic/trytond-account_invoice_facturae
Catalog: locale/*.po
Languages: ca

# field:account.configuration,facturae_certificate:
source: Factura-e Certificate
ca: Certificat Factura-e

# field:account.configuration,facturae_service:
source: Factura-e Service
ca: Servei Factura-e

# field:account.configuration,invoice_facturae_after:
source: Send Factura-e after
ca: Envia

# field:account.configuration.facturae,company:
source: Company
ca: Empresa

# field:account.configuration.facturae,facturae_certificate:
source: Factura-e Certificate
ca: Certificat Factura-e

# field:account.configuration.facturae,facturae_service:
source: Factura-e Service
ca: Servei Factura-e

# field:account.invoice,credited_invoices:
source: Credited Invoices
ca: Factures abonades

# field:account.invoice,file_reference:
source: File Reference
ca: Número d'expedient

# field:account.invoice,invoice_description:
source: Invoice Description
ca: Descripció de la factura

# field:account.invoice,invoice_facturae_filename:
source: Factura-e filename
ca: Nom ficher Factura-e

# field:account.invoice,invoice_facturae_sent:
source: Factura-e Sent
ca: Factura-e Enviada

# field:account.invoice,receiver_contract_reference:
source: Receiver Contract Reference
ca: Número de contracte

# field:account.invoice,rectificative_reason_code:
source: Rectificative Reason Code
ca: Codi motiu rectificació

# field:account.invoice.credit.start,rectificative_reason_code:
source: Rectificative Reason Code
ca: Codi motiu rectificació

# field:account.invoice.generate_facturae.start,certificate:
source: Factura-e Certificate
ca: Certificat Factura-e

# field:account.invoice.generate_facturae.start,service:
source: Factura-e Service
ca: Servei Factura-e

# field:account.payment.type,facturae_type:
source: Factura-e Type
ca: Tipus Factura-e

# field:account.tax,report_type:
source: Report Type
ca: Tipus informe

# field:account.tax.template,report_type:
source: Report Type
ca: Tipus Informe

# field:company.company,facturae_person_type:
source: Person Type
ca: Tipus persona

# field:company.company,facturae_residence_type:
source: Residence Type
ca: Tipus residència

# field:party.address,facturae_outchannel:
source: Send Channel Used
ca: Canal d'enviament

# field:party.address,facturae_person_type:
source: Person Type
ca: Tipus persona

# field:party.address,facturae_residence_type:
source: Residence Type
ca: Tipus residència

# field:party.address,file_reference:
source: File Reference
ca: Número d'expedient

# field:party.address,receiver_contract_reference:
source: Receiver Contract Reference
ca: Número de contracte

# field:sale.sale,file_reference:
source: File Reference
ca: Número d'expedient

# field:sale.sale,invoice_description:
source: Invoice Description
ca: Descripció de la factura

# field:sale.sale,receiver_contract_reference:
source: Receiver Contract Reference
ca: Número de contracte

# field:sale.sale,receiver_transaction_reference:
source: Receiver Transaction Reference
ca: Operació

# help:account.configuration,facturae_certificate:
source: Certificate to sign Factura-e
ca: Certificat per signar Factura-e

# help:account.configuration,facturae_service:
source: Service to be used when post the invoice
ca: Servei que s'emprarà a l'hora de publicar la factura

# help:account.configuration,invoice_facturae_after:
source: Grace period after which the invoice will be sent to the facturae service. Applies only if a worker queue is activated.
ca: Període de gràcia després del qual la factura s'enviarà al servei factura-e. Només s'aplica si una worker queue es activada.

# help:account.configuration.facturae,facturae_certificate:
source: Certificate to sign Factura-e
ca: Certificat per signar Factura-e

# model:account.configuration.facturae,name:
source: Account Configuration Factura-e
ca: Configuració comptable Factura-e

# model:account.invoice.generate_facturae.start,name:
source: Generate Factura-e file - Start
ca: Inici genera fitxer Factura-e

# model:ir.action,name:wizard_generate_signed_facturae
source: Generate Factura-e
ca: Genera Factura-e

# model:ir.message,text:company_address_fields
source: Missing Street, Postal Code, City, Subdivision or Country in default address of company\'s Party "%(party)s".
ca: Falta el carrer, codi postal, ciutat, província o país de la direcció per defecte del tercer de l'empresa "%(party)s".

# model:ir.message,text:company_vat_identifier
source: Missing VAT Identifier in company\'s Party "%(party)s", or its length is not between 3 and 30.
ca: Falta l'identificador VAT del tercer de l'empresa "%(party)s", o la seva longitud no és superior a 3 i inferior a 30.

# model:ir.message,text:error_signing
source: Error signing invoice "%(invoice)s". Message returned by signing process: %(process_output)s
ca: Error firmant la factura "%(invoice)s". Missatge retornat pel procés de firma: %(process_output)s

# model:ir.message,text:incompatible_facturae_type_account_bank
source: The Factura-e Type and Account Bank Kind of Payment Type "%(payment_type)s" are not compatible.
ca: El Tipus Fatura-e i el Tipus compte bancari del Tipus de pagament "%(payment_type)s" no són compatibles.

# model:ir.message,text:invalid_factura_xml_file
source: The Factura-e file (XML) generated for invoice "%(invoice)s" is not valid against the oficial XML Schema Definition: %(message)s
ca: El fitxer Factura-e (XML) generat per la factura "%(invoice)s" no és vàlid segons el XML Schema Definition oficial: %(message)s

# model:ir.message,text:invoice_address_fields
source: Missing Street, Postal Code, City, Subdivision or Country in Invoice Address of invoice "%(invoice)s".
ca: Falta el carrer, codi postal, ciutat, subdivisió o país a l'adreça de la factura "%(invoice)s".

# model:ir.message,text:missing_account_bank_module
source: You must to install "account_bank" module to inform the Bank Account in invoices. The payment type "%(payment_type)s" used in invoice "%(invoice)s" is configured as "Direct Debit" or "Credit Transfer" and it requires the company/party bank account.
ca: S'ha d'instal·lar el mòdul "account_bank" per poder indicar el compte bancari a les factures. El tipus de pagament "%(payment_type)s" utilitzat a la factura "%(invoice)s" està configurat com "Rebut domiciliat" o "Transferència" i es requereix el copmte bancari de l'empresa o del tercer.

# model:ir.message,text:missing_bank_account
source: The Bank Account is missing in some move lines of invoice "%(invoice)s".
ca: Falta el compte bancari en algun dels apunts de la factura "%(invoice)s".

# model:ir.message,text:missing_iban
source: The Bank Account "%(bank_account)s" used in invoice "%(invoice)s" doesn\'t have an IBAN number and it\'s required to generate the Factura-e document.
ca: El compte bancari "%(bank_account)s" utilitzat a la factura "%(invoice)s" no té número IBAN i es requereix per generar el document Factura-e.

# model:ir.message,text:missing_payment_type
source: The payment type is missing in some move lines of invoice "%(invoice)s".
ca: Falta el tipus de pagament en alguns apunts de la factura "%(invoice)s".

# model:ir.message,text:missing_payment_type_facturae_type
source: The Factura-e Type is missing in payment type "%(payment_type)s" used in invoice "%(invoice)s".
ca: Falta el Tipus Factura-e al tipus de pagament "%(payment_type)s" utilitzat a la factura "%(invoice)s".

# model:ir.message,text:msg_certificate_error
source: Error while getting the certificate: "%(error)s".
ca: S'ha produït un error mentre s'obtenia el certificat: "%(error)s".

# model:ir.message,text:msg_draft_invoice_facturae_sent
source: Can not draft "%(invoices)s" that have been sent to Factura-e.
ca: No es poden tornar a esborrany "%(invoices)s" que s'han enviat a Factura-e.

# model:ir.message,text:msg_future_facturae_warning
source: Invoice date of invoice %(id)s is set in the future. Are you sure you want to proceed?
ca: La data de factura de la factura %(id)s es establerta en el futur. Segur que vols continuar?

# model:ir.message,text:msg_missing_certificate
source: Missing default configuration Factura-e Certificate.
ca: Falta la configuració del Certificat Factura-e

# model:ir.message,text:msg_missing_password_certificate
source: Missing Password Factura-e Certificate in company "%(company)s".
ca: Falta la contrasenya del certificat Factura-e a l'empresa "%(company)s".

# model:ir.message,text:msg_no_facturae
source: Invoice %(invoice)s has no factura-e file.
ca: La factura %(invoice)s no té cap fitxer factura-e.

# model:ir.message,text:msg_party_wrong_fields_filled
source: You cannot configure a party with the "Sales Invoice Grouping Method" set to Standard and the "File Reference" or "Receiver Contract Reference" fields filled.
ca: No pots configurar un tercer amb el "Mètode d'agrupació factures de venda" com a "Estàndard" i els camps "Número d'expedient" o "Número de contracte" omplerts.

# model:ir.message,text:no_rate
source: No rate found for currency "%(currency)s" on "%(date)s"
ca: No s'ha trobat cap taxa de canvi per a la moneda "%(currency)s" a la data "%(date)s".

# model:ir.message,text:party_facturae_fields
source: Missing some Factura-e fields in party "%(party)s" of invoice "%(invoice)s": "%(field)s"
ca: Falta alguns camps del tercer "%(party)s" per la Factura-e de la factura "%(invoice)s": "%(field)s"

# model:ir.message,text:party_name_surname
source: The name of "%(party)s" of invoice "%(invoice)s" doesn\'t contain the Name and the, at least, First Surname. They must to be separated by one space: Name Surname.
ca: El nom del tercer "%(party)s" de la factura "%(invoice)s" no conté el nom i, al menys, el primer cognom. Aquests han d'anar separats per un espai: Nom Cognom.

# model:ir.message,text:party_vat_identifier
source: Missing VAT Identifier in party "%(party)s" of invoice "%(invoice)s", or its length is not between 3 and 30
ca: Falta l'identificador VAT del tercer "%(party)s" de la factura "%(invoice)s", o la seva longitud no és superior a 3 i inferior a 30.

# model:ir.model.button,string:generate_facturae_button
source: Generate Facturae
ca: Crea Facturae

# selection:account.configuration.facturae,facturae_service:
source: None
ca: Cap

# selection:account.configuration.facturae,facturae_service:
source: Only Generate Facturae
ca: Només genera Factura-e

# selection:account.invoice,rectificative_reason_code:
source: Applicable Date/Period
ca: Data/Període a aplicar

# selection:account.invoice,rectificative_reason_code:
source: Applicable Tax Amount
ca: Quota tributària a aplicar

# selection:account.invoice,rectificative_reason_code:
source: Applicable Tax Rate
ca: Percentatge impositiu a aplicar

# selection:account.invoice,rectificative_reason_code:
source: Calculation of tax inputs
ca: Càlcul de quotes retingudes

# selection:account.invoice,rectificative_reason_code:
source: Calculation of tax outputs
ca: Càlcul de quotes repercutides

# selection:account.invoice,rectificative_reason_code:
source: Invoice Class
ca: Classe de factura

# selection:account.invoice,rectificative_reason_code:
source: Invoice number
ca: Número de la factura

# selection:account.invoice,rectificative_reason_code:
source: Invoice serial number
ca: Serie de la factura

# selection:account.invoice,rectificative_reason_code:
source: Issue date
ca: Data expedició

# selection:account.invoice,rectificative_reason_code:
source: Issuer's Tax Identification Number
ca: Identificació fiscal emissor/obligat

# selection:account.invoice,rectificative_reason_code:
source: Issuer's address
ca: Domicili emissor/Obligat

# selection:account.invoice,rectificative_reason_code:
source: Item line
ca: Detall operació

# selection:account.invoice,rectificative_reason_code:
source: Legal literals
ca: Literals legals

# selection:account.invoice,rectificative_reason_code:
source: Name and surnames/Corporate name-Issuer (Sender)
ca: Nom i cognoms/Raó social-Emissor

# selection:account.invoice,rectificative_reason_code:
source: Name and surnames/Corporate name-Receiver
ca: Nom i cognoms/Raó social-Receptor

# selection:account.invoice,rectificative_reason_code:
source: Receiver's Tax Identification Number
ca: Identificació fiscal receptor

# selection:account.invoice,rectificative_reason_code:
source: Receiver's address
ca: Domicili receptor

# selection:account.invoice,rectificative_reason_code:
source: Taxable Base
ca: Base imposable

# selection:account.invoice,rectificative_reason_code:
source: Taxable Base modified due to discounts and rebates
ca: Base imposable modificada per descomptes i bonificacions

# selection:account.invoice,rectificative_reason_code:
source: Taxable Base modified due to firm court ruling or administrative decision
ca: Base imposable modificada per resolució ferma, judicial o administrativa

# selection:account.invoice,rectificative_reason_code:
source: Taxable Base modified due to return of packages and packaging materials
ca: Base imposable modificada per devolució d'envasos/embalatges

# selection:account.invoice,rectificative_reason_code:
source: Taxable Base modified due to unpaid outputs where there is a judgement opening insolvency proceedings
ca: Base imposable modificada quotes repercutides no satisfetes. Autodeclaració en curs

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Applicable Date/Period
ca: Data/Període a aplicar

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Applicable Tax Amount
ca: Quota tributària a aplicar

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Applicable Tax Rate
ca: Percentatge impositiu a aplicar

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Calculation of tax inputs
ca: Càlcul de quotes retingudes

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Calculation of tax outputs
ca: Càlcul de quotes repercutides

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Invoice Class
ca: Classe de factura

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Invoice number
ca: Número de la factura

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Invoice serial number
ca: Serie de la factura

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Issue date
ca: Data expedició

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Issuer's Tax Identification Number
ca: Identificació fiscal emissor/obligat

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Issuer's address
ca: Domicili emissor/Obligat

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Item line
ca: Detall operació

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Legal literals
ca: Literals legals

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Name and surnames/Corporate name-Issuer (Sender)
ca: Nom i cognoms/Raó social-Emissor

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Name and surnames/Corporate name-Receiver
ca: Nom i cognoms/Raó social-Receptor

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Receiver's Tax Identification Number
ca: Identificació fiscal receptor

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Receiver's address
ca: Domicili receptor

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Taxable Base
ca: Base imposable

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Taxable Base modified due to discounts and rebates
ca: Base imposable modificada per descomptes i bonificacions

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Taxable Base modified due to firm court ruling or administrative decision
ca: Base imposable modificada per resolució ferma, judicial o administrativa

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Taxable Base modified due to return of packages and packaging materials
ca: Base imposable modificada per devolució d'envasos/embalatges

# selection:account.invoice.credit.start,rectificative_reason_code:
source: Taxable Base modified due to unpaid outputs where there is a judgement opening insolvency proceedings
ca: Base imposable modificada quotes repercutides no satisfetes. Autodeclaració en curs

# selection:account.invoice.generate_facturae.start,service:
source: None
ca: Cap

# selection:account.invoice.generate_facturae.start,service:
source: Only Generate Facturae
ca: Només genera Factura-e

# selection:account.payment.type,facturae_type:
source: Accepted bill of exchange
ca: Lletra acceptada

# selection:account.payment.type,facturae_type:
source: Banker's draft
ca: Xec bancari

# selection:account.payment.type,facturae_type:
source: Bill of exchange
ca: Lletra de canvi

# selection:account.payment.type,facturae_type:
source: Cash on delivery
ca: Pagament contra reembolsament

# selection:account.payment.type,facturae_type:
source: Certified cheque
ca: Xec conformat

# selection:account.payment.type,facturae_type:
source: Cheque
ca: Xec

# selection:account.payment.type,facturae_type:
source: Contract award
ca: Contracte adjudicació

# selection:account.payment.type,facturae_type:
source: Credit transfer
ca: Transferència

# selection:account.payment.type,facturae_type:
source: Direct debit
ca: Rebut domiciliat

# selection:account.payment.type,facturae_type:
source: Documentary credit
ca: Crèdit documentari

# selection:account.payment.type,facturae_type:
source: In cash
ca: Al comptat

# selection:account.payment.type,facturae_type:
source: Non transferable promissory note
ca: Pagaré no a l'ordre

# selection:account.payment.type,facturae_type:
source: Open account reimbursement
ca: Reposició

# selection:account.payment.type,facturae_type:
source: Payment by card
ca: Pagament per targeta

# selection:account.payment.type,facturae_type:
source: Payment by postgiro
ca: Gir postal

# selection:account.payment.type,facturae_type:
source: Receipt
ca: Rebut

# selection:account.payment.type,facturae_type:
source: Set-off by reciprocal credits
ca: Compensació

# selection:account.payment.type,facturae_type:
source: Special payment
ca: Especials

# selection:account.payment.type,facturae_type:
source: Transferable promissory note
ca: Pagaré a l'ordre

# selection:account.tax,report_type:
source: Corporation Tax
ca: Impost de Societats

# selection:account.tax,report_type:
source: Excise duty applied to manufactured tobacco in Canaries
ca: Impost especial aplicat al tabac elaborat a Canàries

# selection:account.tax,report_type:
source: ICIO: Tax on construction, installation and works
ca: ICIO: Impost sobre construccions, instal·lacions i obres

# selection:account.tax,report_type:
source: IDEC: Tax on bank deposits
ca: IDEC: Impost sobre dipòsits bancaris

# selection:account.tax,report_type:
source: IE: Excise duties and consumption taxes
ca: IE: impostos especials i impostos al consum

# selection:account.tax,report_type:
source: IECDPCAC: Excise duties on oil derivates in Canaries
ca: IECDPCAC: Impostos especials sobre derivats del petroli a Canàries

# selection:account.tax,report_type:
source: IGFEI: Tax on Fluorinated Greenhouse Gases
ca: IGFEI: Impost sobre els gasos fluorats d'efecte hivernacle

# selection:account.tax,report_type:
source: IGIC:Canaries General Indirect Tax
ca: IGIC:Impost Indirecte General de Canàries

# selection:account.tax,report_type:
source: IGTECM: Sales tax in Ceuta and Melilla
ca: IGTECM: Impost de vendes a Ceuta i Melilla

# selection:account.tax,report_type:
source: IIIMAB: Tax on premises that affect the environment in the Balearic Islands
ca: IIIMAB: Impost sobre locals que afecten el medi ambient a les Illes Balears

# selection:account.tax,report_type:
source: IMGSN: Local sumptuary tax in Navarre
ca: IMGSN: Impost sumptuari local de Navarra

# selection:account.tax,report_type:
source: IMPN: Local tax on advertising in Navarre
ca: IMPN: Impost local de publicitat a Navarra

# selection:account.tax,report_type:
source: IMSN: Local tax on building plots in Navarre
ca: IMSN: Impost local de solars edificables de Navarra

# selection:account.tax,report_type:
source: IMVDN: Local tax on unoccupied homes in Navarre
ca: IMVDN: Impost local d'habitatges desocupats a Navarra

# selection:account.tax,report_type:
source: IPS: Insurance premiums Tax
ca: IPS: Impost sobre primes d'assegurances

# selection:account.tax,report_type:
source: IRNR: Non-resident Income Tax
ca: IRNR: Impost sobre la Renda de No Residents

# selection:account.tax,report_type:
source: IRPF:Personal Income Tax
ca: IRPF:Impost sobre la Renda de les Persones Físiques

# selection:account.tax,report_type:
source: ITPAJD:Tax on wealth transfers and stamp duty
ca: ITPAJD:Impost sobre transmissions patrimonials i impost de timbre

# selection:account.tax,report_type:
source: IVPEE: Tax on the value of electricity generation
ca: IVPEE: Impost sobre el valor de la generació elèctrica

# selection:account.tax,report_type:
source: Other
ca: Un altre

# selection:account.tax,report_type:
source: REIGIC: Special IGIC: for travel agencies
ca: REIGIC: IGIC especial: per a agències de viatges

# selection:account.tax,report_type:
source: REIPSI: Special IPSI for travel agencies
ca: REIPSI: IPSI especial per a agències de viatges

# selection:account.tax,report_type:
source: REIVA: Special VAT for travel agencies
ca: REIVA: IVA especial per a agències de viatges

# selection:account.tax,report_type:
source: Ra: Customs duties
ca: Ra: Drets de duana

# selection:account.tax,report_type:
source: SWUA: Surcharge for Winding Up Activity
ca: SWUA: Recàrrec per l'activitat de liquidació

# selection:account.tax,report_type:
source: Tax on the production of spent nuclear fuel and radioactive waste from the generation of nuclear electric power
ca: Impost sobre la producció de combustible nuclear gastat i residus radioactius procedents de la generació d'energia elèctrica nuclear

# selection:account.tax,report_type:
source: Tax on the storage of spent nuclear energy and radioactive waste in centralised facilities
ca: Impost sobre l'emmagatzematge d'energia nuclear gastada i residus radioactius en instal·lacions centralitzades

# selection:account.tax,report_type:
source: Taxes on production, services and imports in Ceuta and Melilla
ca: Impostos sobre producció, serveis i importacions a Ceuta i Melilla

# selection:account.tax,report_type:
source: Value-Added Tax
ca: Impost sobre el valor afegit

# selection:account.tax.template,report_type:
source: Corporation Tax
ca: Impost de Societats

# selection:account.tax.template,report_type:
source: Excise duty applied to manufactured tobacco in Canaries
ca: Impost especial aplicat al tabac elaborat a Canàries

# selection:account.tax.template,report_type:
source: ICIO: Tax on construction, installation and works
ca: ICIO: Impost sobre construccions, instal·lacions i obres

# selection:account.tax.template,report_type:
source: IDEC: Tax on bank deposits
ca: IDEC: Impost sobre dipòsits bancaris

# selection:account.tax.template,report_type:
source: IE: Excise duties and consumption taxes
ca: IE: Impostos especials i impostos al consum

# selection:account.tax.template,report_type:
source: IECDPCAC: Excise duties on oil derivates in Canaries
ca: IECDPCAC: Impostos especials sobre derivats del petroli a Canàries

# selection:account.tax.template,report_type:
source: IGFEI: Tax on Fluorinated Greenhouse Gases
ca: IGFEI: Impost sobre els gasos fluorats d'efecte hivernacle

# selection:account.tax.template,report_type:
source: IGIC:Canaries General Indirect Tax
ca: IGIC:Impost Indirecte General de Canàries

# selection:account.tax.template,report_type:
source: IGTECM: Sales tax in Ceuta and Melilla
ca: IGTECM: Impost de vendes a Ceuta i Melilla
