Repository: NaN-tic/trytond-account_invoice_facturae
Catalog: locale/*.po
Languages: ca

# selection:account.tax.template,report_type:
source: IIIMAB: Tax on premises that affect the environment in the Balearic Islands
ca: IIIMAB: Impost sobre locals que afecten el medi ambient a les Illes Balears

# selection:account.tax.template,report_type:
source: IMGSN: Local sumptuary tax in Navarre
ca: IMGSN: Impost sumptuari local de Navarra

# selection:account.tax.template,report_type:
source: IMPN: Local tax on advertising in Navarre
ca: IMPN: Impost local de publicitat a Navarra

# selection:account.tax.template,report_type:
source: IMSN: Local tax on building plots in Navarre
ca: IMSN: Impost local de solars edificables de Navarra

# selection:account.tax.template,report_type:
source: IMVDN: Local tax on unoccupied homes in Navarre
ca: IMVDN: Impost local d'habitatges desocupats a Navarra

# selection:account.tax.template,report_type:
source: IPS: Insurance premiums Tax
ca: IPS: Impost sobre primes d'assegurances

# selection:account.tax.template,report_type:
source: IRNR: Non-resident Income Tax
ca: IRNR: Impost sobre la Renda de No Residents

# selection:account.tax.template,report_type:
source: IRPF:Personal Income Tax
ca: IRPF:Impost sobre la Renda de les Persones Físiques

# selection:account.tax.template,report_type:
source: ITPAJD:Tax on wealth transfers and stamp duty
ca: ITPAJD:Impost sobre transmissions patrimonials i impost de timbre

# selection:account.tax.template,report_type:
source: IVPEE: Tax on the value of electricity generation
ca: IVPEE: Impost sobre el valor de la generació elèctrica

# selection:account.tax.template,report_type:
source: Other
ca: Un altre

# selection:account.tax.template,report_type:
source: REIGIC: Special IGIC: for travel agencies
ca: REIGIC: IGIC especial: per a agències de viatges

# selection:account.tax.template,report_type:
source: REIPSI: Special IPSI for travel agencies
ca: REIPSI: IPSI especial per a agències de viatges

# selection:account.tax.template,report_type:
source: REIVA: Special VAT for travel agencies
ca: REIVA: IVA especial per a agències de viatges

# selection:account.tax.template,report_type:
source: Ra: Customs duties
ca: Ra: Drets de duana

# selection:account.tax.template,report_type:
source: SWUA: Surcharge for Winding Up Activity
ca: SWUA: Recàrrec per l'activitat de liquidació

# selection:account.tax.template,report_type:
source: Tax on the production of spent nuclear fuel and radioactive waste from the generation of nuclear electric power
ca: Impost sobre la producció de combustible nuclear gastat i residus radioactius procedents de la generació d'energia elèctrica nuclear

# selection:account.tax.template,report_type:
source: Tax on the storage of spent nuclear energy and radioactive waste in centralised facilities
ca: Impost sobre l'emmagatzematge d'energia nuclear gastada i residus radioactius en instal·lacions centralitzades

# selection:account.tax.template,report_type:
source: Taxes on production, services and imports in Ceuta and Melilla
ca: Impostos sobre producció, serveis i importacions a Ceuta i Melilla

# selection:account.tax.template,report_type:
source: Value-Added Tax
ca: Impost sobre el valor afegit

# selection:company.company,facturae_person_type:
source: Individual
ca: Persona física

# selection:company.company,facturae_person_type:
source: Legal Entity
ca: Persona jurídica

# selection:company.company,facturae_residence_type:
source: Foreigner
ca: Estranger (Fora Unió Europea)

# selection:company.company,facturae_residence_type:
source: Resident in Spain
ca: Resident (a Espanya)

# selection:company.company,facturae_residence_type:
source: Resident in other EU country
ca: Resident a la Unió Europea (excepte Espanya)

# selection:party.address,facturae_outchannel:
source: Service Default
ca: Servei per defecte

# selection:party.address,facturae_person_type:
source: Individual
ca: Persona física

# selection:party.address,facturae_person_type:
source: Legal Entity
ca: Persona jurídica

# selection:party.address,facturae_residence_type:
source: Foreigner
ca: Estranger (Fora Unió Europea)

# selection:party.address,facturae_residence_type:
source: Resident in Spain
ca: Resident (a Espanya)

# selection:party.address,facturae_residence_type:
source: Resident in other EU country
ca: Resident a la Unió Europea (excepte Espanya)

# view:account.invoice.generate_facturae.start:
source: It will generate a Factura-e file for selected invoices, will sign them with the certificate stored in the company and will save the resulting files in each invoice.
ca: Es generarà un fitxer Factura-e per cada factura seleccionada, es firma amb el certificat de l'empresa i es guarda els fitxers resultants a cada factura.

# view:account.invoice:
source: Generate Factura-e
ca: Genera Factura-e

# wizard_button:account.invoice.generate_facturae,start,end:
source: Cancel
ca: Cancel·la

# wizard_button:account.invoice.generate_facturae,start,generate:
source: Generate
ca: Genera
